# lst = [1,2,3,4,5,6,7,8,9]
# lst2 = [1,2,3,4,5,6,7,8,9]
#
# lst[2:4] = ["good", "well done"]
# lst[:6:2] = [0,0,0]
# lst[2:4] = 10, 20
#
# print(lst != lst2)

# Имеется список числа просмотров видео по дням:
# v = [1205, 1101, 1434, 1320, 923, 874]
# Необходимо выбрать из него первые три значения (используя срезы) и вывести результат на экран.
# v = [1205, 1101, 1434, 1320, 923, 874]
# print(v[:3])
#
# Необходимо выбрать из него последние четыре значения (используя срезы) и вывести результат на экран.
# v = [1205, 1101, 1434, 1320, 923, 874]
# print(v[-4:])

# Имеется список городов:
# c = ["Москва", "Ульяновск", "Самара", "Тверь", "Вологда", "Омск", "Уфа"]
# Необходимо с помощью срезов выбрать из него города через один (начиная с первого) и результат вывести на экран
# c = ["Москва", "Ульяновск", "Самара", "Тверь", "Вологда", "Омск", "Уфа"]
# print(c[::2])

# Необходимо с помощью срезов выбрать из него города через один (начиная со второго) и результат вывести на экран.
# c = ["Москва", "Ульяновск", "Самара", "Тверь", "Вологда", "Омск", "Уфа"]
# print(c[1::2])

# Имеется список с оценками студента:
# m = [2, 3, 5, 5, 2, 2, 3, 3, 4, 5, 4, 4]
# Необходимо с помощью срезов выбрать элементы с 3-го по 7-й (включительно) и вывести их на экран в обратном порядке.
# m = [2, 3, 5, 5, 2, 2, 3, 3, 4, 5, 4, 4]
# print(m[-6:-11:-1])

# Необходимо с помощью срезов выбрать элементы через один, начиная с последнего, и вывести результат на экран.
# m = [2, 3, 5, 5, 2, 2, 3, 3, 4, 5, 4, 4]
# print(m[::-2])