# \n - Спецсимвол перевода строки
# "r" - Перед началом строки сделает так что все символы строки будут восприниматься буквально

# text = """python
# hello"""
# print(text)

# t = "\tpanda needs\npython"
# print(t)

# Необходимо задать строку со следующим содержимым: Тема занятия "спецсимволы".
# И отобразить ее на экране (кавычки у слова спецсимволы также должны быть отображены).
# text = 'Тема занятия "спецсимволы"'
# print(text)

# Вводится два слова в одну строку через пробел. Поставьте между этими словами символ обратного слеша (вместо пробела).
# Результирующую строку отобразите на экране.
# text = input()
# print("\\".join(text.split()))

# Вводится строка со словами, разделенными пробелом.
# Необходимо первый пробел заменить на одинарную кавычку, а все остальные - на двойные.
# Результирующую строку отобразить на экране.
# text = input()
# print(text.replace(" ", "'", 1).replace(" ", '"'))

# Используя raw-строки, задайте строку, содержащую этот путь к файлу: C:\WINDOWS\System32\drivers\etc\hosts.
# Результат отобразите на экране.
# text = r"C:\WINDOWS\System32\drivers\etc\hosts"
# print(text)

# Вводится слово. Необходимо сформировать новую строку, где введенное слово будет заключено в двойные кавычки.
# Результат выведите на экран.
# word = input()
# print('"' + (word) + '"')